Revit 2024 API
Curve.ApproximateLength Property
The approximate length of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double ApproximateLength { get; }
Visual Basic
Public ReadOnly Property ApproximateLength As Double
	Get
Visual C++
public:
property double ApproximateLength {
	double get ();
}
Remarks
Quickly estimates the length of the curve, may deviate by a factor of 2 in some cases. The computation is exact for lines and arcs.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the curve is unbound and not periodic.
See Also
Curve Class
Autodesk.Revit.DB Namespace